[
  {
    "Movement / Boycott Campaign": "BDS Movement",
    "Target Brands / Companies": "Airbnb, Amazon, AXA, Booking.com, Burger King, Chevron, Dell, Disney, Domino's Pizza, Expedia, Google, HPE, Intel, JCB, McDonald's, Microsoft, Papa John's, Pizza Hut, Reebok, Sabra Hummus, Siemens, SodaStream, Texaco, Volvo, ZARA, Caterpillar",
    "Categories": "Labor & Human Rights, Social Responsibility",
    "Overview": "The BDS movement encourages people to avoid companies that profit from Israeli settlements in Palestinian territories. It’s about supporting Palestinian human rights and encouraging companies to respect international law, using economic pressure as a way to push for change.",
    "Read More": "https://bdsmovement.net/Act-Now-Against-These-Companies-Profiting-From-Genocide"
  },
  {
    "Movement / Boycott Campaign": "Boycott Nestlé",
    "Target Brands / Companies": "KitKat, Smarties, Aero, Milkybar, Quality Street, After Eight, Lion, Rolo, Milkybar Buttons, Nescafé, Nespresso, Nesquik, Starbucks (via Nestlé), Carnation, Nestlé Ice Cream, La Lechera, Maggi, Buitoni, Stouffer’s, NAN, Gerber, Nesquik Cereal, Shredded Wheat, Fitness Cereal, Perrier, San Pellegrino",
    "Categories": "Environment, Labor & Human Rights, Corporate Governance",
    "Overview": "Nestlé has been criticized for over-extracting water, using child labor in cocoa supply chains, sourcing unsustainable palm oil, and contributing to plastic pollution. The boycott encourages the company to adopt ethical sourcing, better environmental practices, and fair treatment of workers.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Boycott Amazon",
    "Target Brands / Companies": "Amazon UK, Whole Foods UK, Audible, Twitch",
    "Categories": "Labor & Human Rights, Corporate Governance",
    "Overview": "Amazon has faced criticism for poor treatment of warehouse workers, attempts to prevent unionization, tax avoidance, and environmental impact. This boycott asks consumers to encourage fairer labor practices and greater corporate accountability.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Boycott Starbucks",
    "Target Brands / Companies": "Starbucks UK",
    "Categories": "Labor & Human Rights, Corporate Governance",
    "Overview": "Starbucks has faced criticism for anti-union actions, tax avoidance, and its involvement in politically sensitive issues. Avoiding Starbucks encourages ethical business practices and fair treatment of employees, while supporting a more transparent corporate culture.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Boycott Coca-Cola",
    "Target Brands / Companies": "Coca-Cola, Diet Coke, Coca-Cola Zero Sugar, Fanta, Sprite, Schweppes, Minute Maid, Innocent Smoothies, Costa Coffee, Smartwater, Appletiser, Gold Peak, Fuze Tea, Honest Tea, Barq’s, Topo Chico, Aquarius, Ades, Fresca, I LOHAS, Ayataka, Ciel, Dogadan, Peace Tea, Karma Cola",
    "Categories": "Labor & Human Rights, Environment, Social Responsibility",
    "Overview": "Coca-Cola has been named one of the world’s largest contributors to plastic pollution and has faced criticism for water depletion in local communities and union repression. The boycott encourages companies to use water responsibly, protect labor rights, and reduce their environmental impact.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Stop Funding Fossils",
    "Target Brands / Companies": "Barclays, HSBC, Standard Chartered, Lloyds, NatWest, Santander, Lloyds of London",
    "Categories": "Environment, Corporate Governance",
    "Overview": "Many UK banks are still financing fossil fuel projects, contributing to climate change. This boycott asks people to push financial institutions toward investing in sustainable energy, reducing reliance on fossil fuels, and promoting a greener economy.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Uyghur Forced Labor Boycott",
    "Target Brands / Companies": "Nike, Adidas, H&M, Apple, Shein, Uniqlo, Marks & Spencer, Gap, Topshop / Topman, Skechers",
    "Categories": "Labor & Human Rights, Corporate Governance",
    "Overview": "Some brands have been linked to forced labor in Xinjiang, China. By participating in this boycott, consumers are supporting human rights, encouraging companies to audit their supply chains, and avoiding products tied to forced labor.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Fair Chocolate / Stop Child Labour",
    "Target Brands / Companies": "Cadbury (Mondelez), Galaxy/Mars, Ferrero, Nestlé, Hershey",
    "Categories": "Labor & Human Rights, Social Responsibility",
    "Overview": "Some chocolate is still made using child labor. This boycott encourages companies to adopt fair trade practices, protect children from exploitation, and promote ethical cocoa sourcing.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Fast Fashion Boycott",
    "Target Brands / Companies": "Primark, Boohoo, ASOS, Shein, Zara, H&M, Sports Direct, Temu, MissGuided, Fashion Nova, Cider, Pretty Little Thing",
    "Categories": "Labor & Human Rights, Environment, Social Responsibility",
    "Overview": "Fast fashion often relies on sweatshops with unsafe working conditions and contributes to environmental damage. Boycotting these brands encourages ethical labor practices, sustainable manufacturing, and environmental responsibility.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Cruelty-Free / Animal Testing Boycott",
    "Target Brands / Companies": "L’Oréal, Estée Lauder, Procter & Gamble, Unilever, Shiseido, Boots No7, CeraVe, Revlon, Elizabeth Arden, Yves Saint Laurent, Giorgio Armani Beauty",
    "Categories": "Animal Welfare, Corporate Governance",
    "Overview": "Many beauty companies still test on animals or sell in regions where animal testing is mandatory. Choosing cruelty-free brands supports animal welfare and encourages more ethical cosmetic practices.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Palm Oil Boycott",
    "Target Brands / Companies": "Nestlé, Unilever, Mondelez, PepsiCo, Mars, Greggs, Warburtons, Reckitt Benckiser, AB Foods, P&G, Kellogg’s, Colgate-Palmolive, Johnson & Johnson, Heinz, SPAR",
    "Categories": "Environment, Animal Welfare, Labor & Human Rights",
    "Overview": "Unsustainable palm oil production leads to deforestation, destruction of wildlife habitats, and human rights abuses. This boycott encourages companies to source palm oil responsibly and protect ecosystems and local communities.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Plastic Waste / Single-Use Plastics",
    "Target Brands / Companies": "Coca-Cola, PepsiCo, Nestlé, McDonald’s UK, Costa Coffee, Tesco, Sainsbury’s, Cadbury, Green & Black’s, Toblerone, Milka, Oreo, BelVita, Barny, LU Biscuits, Chips Ahoy!, Philadelphia, Ritz, TUC",
    "Categories": "Environment, Social Responsibility",
    "Overview": "Single-use plastics are polluting oceans and landfills at an alarming rate. Boycotts encourage companies to reduce packaging, improve recycling, and take responsibility for their environmental impact.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Fair Tax / Tax Justice",
    "Target Brands / Companies": "Amazon UK, Apple UK, Starbucks UK, Meta, Google UK, Nike, McDonald’s, Nestlé, Barclays, Boots, HSBC, Lloyds",
    "Categories": "Corporate Governance, Social Responsibility",
    "Overview": "Some multinational companies avoid paying fair taxes in the UK. Boycotts encourage transparency, responsible taxation, and help fund public services fairly.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Boycott Shell / Fossil Fuel Giants",
    "Target Brands / Companies": "Shell, BP, ExxonMobil, Chevron, TotalEnergies, Equinor",
    "Categories": "Environment, Corporate Governance",
    "Overview": "Fossil fuel companies are responsible for climate change, oil spills, and environmental degradation. Boycotts push for investment in renewable energy and greater corporate responsibility.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Tesla Boycott",
    "Target Brands / Companies": "Tesla UK, X (formerly Twitter), OpenAI, Neuralink, The Boring Company, SpaceX",
    "Categories": "Labor & Human Rights, Corporate Governance, Environment",
    "Overview": "Tesla has faced criticism for unsafe working conditions, poor union treatment, and ethical concerns over cobalt mining. This boycott promotes fair labor practices and ethical technology.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Congo Minerals Boycott",
    "Target Brands / Companies": "Apple, Samsung, Dell, Tesla, Intel, Nokia, Motorola, Huayou Cobalt",
    "Categories": "Labor & Human Rights, Environment",
    "Overview": "Electronics supply chains can include minerals sourced from conflict regions like the DRC. Boycotting these products encourages responsible sourcing and ethical manufacturing.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Anti-Sweatshop Boycotts",
    "Target Brands / Companies": "Primark, Boohoo, Shein, Sports Direct, Nike (historic), Adidas, Temu, Disney, Victoria’s Secret, Apple, Facebook",
    "Categories": "Labor & Human Rights, Social Responsibility",
    "Overview": "Many garment workers face unsafe conditions, low pay, and exploitation. Boycotts push companies to improve labor standards, ensure fair wages, and create safer workplaces.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "BankTrack Campaigns",
    "Target Brands / Companies": "Barclays, HSBC, Lloyds, Standard Chartered, BNP Paribas",
    "Categories": "Environment, Corporate Governance",
    "Overview": "Banks sometimes finance fossil fuel projects or the arms trade. Boycotts encourage ethical banking, responsible investment, and transparency.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Factory Farming Boycott",
    "Target Brands / Companies": "Tesco (own-label meat/dairy), Asda, Sainsbury’s, Morrisons, Aldi, Lidl, McDonald’s UK, KFC, Burger King, Greggs, Domino’s",
    "Categories": "Animal Welfare, Environment, Social Responsibility",
    "Overview": "Industrial meat and dairy production often involves animal cruelty, overuse of antibiotics, and environmental damage. Boycotts encourage plant-based alternatives and ethically sourced foods.",
    "Read More": null
  },
  {
    "Movement / Boycott Campaign": "Boycott Russian Goods",
    "Target Brands / Companies": "Russian Standard Vodka, Beluga Vodka, Kaspersky Labs",
    "Categories": "Social Responsibility",
    "Overview": "Targets Russian companies as a response to geopolitical conflict and human rights violations. Encourages consumer leverage against unethical state-linked businesses.",
    "Read More": null
  }
]